package com.leoi555.javaTest;

public class test08 {

	/*
	 * 1、写出数组定义的几种方式，并举例说明
	 * 答案：
	 * 
	 * 2、通过键盘输入12个月收入额，并求总收入
	 * 在Demo1.java文件中编写 
	 *
	 * 3、通过键盘输入5个学生成绩，输出学生中最高分以及最低分是多少
	 * 并输出平均成绩
	 * 在Demo2.java文件中编写 
	 * 
	 * 4、 下列数组的声明有哪些是对的？错的应该怎么修改？ A. int[] a; B. int a[] = new int[3]; C. int[]
	 * a; a = {1,2,3,4,5}; D. int[] a = new int[3]{1,2,3};
	 * 答案：
	 * 
	 * 5、将一个给定的整型数组转置输出，
	 * 
	 * 例如：源数组，1 2 3 4 5 6 转置之后的数组，6 5 4 3 2 1
	 * 在Demo3.java文件中编写 
	 * 
	 * 6、通过两种方式遍历数组{12,34,53,22,13,15}
	 * 在Demo4.java文件中编写 
	 * 
	 * 7、获取1到100以内的所有能被3整除同时不能被5整除的数字的信息，放入到数组中，并打印输出
	 * 在Demo5.java文件中编写 
	 * 
	 * 8、（选做）模拟实现双色球游戏 6+1
	 * 
	 * 6个红球：1-33 之间随机生成的整数 不能重复
	 * 
	 * 1个篮球：1-16之间的 可以和红球重复
	 * 
	 * 在Demo6.java文件中编写 
	 * 
	 * 
	 * 9、预习数组排序，二维数组
	 * 
	 */
	public static void main(String[] args) {
		System.out.println("作业文档");
	}
}
