package com.leoi555.javaTest;

public class test05 {

	/*
	 * 1、读入三个 整数，输出这中最大的一个。
	 * 在Demo1.java编写
	 * 2:for循环的格式?要能看懂执行流程。 用for循环完成如下案例
	 * 
	 * 求和（1-100之间的数字） 求偶数和（1-100之间的数字） 求奇数和（1-100之间的数字） 打印水仙花数 三位数
	 * bai*bai*bai+shi*shi*shi+ge*ge*ge=baishige 统计水仙花数 求5的阶乘
	 * 在Demo2.java编写
	 * 3、托运计费问题： 当货物重量小于20 公斤的时候，收费5 元，大于20 公斤小于100 公斤的时 候超出20 公斤的部分按每0.2
	 * 元每公斤计费，如果超出100 公斤的时候，超出 的部分按照每公斤0.15 元计算。 读入货物的重量，输出计算之后货物的运费。
	 * 在Demo3.java编写
	 * 
	 * 4、（选做）中国的个税计算方法： 应税所得为税前收入扣除2000 元（起征点），然后超出部分，按照以下税率 收税： 500 5% 500-2000
	 * 10% 2000-5000 15% 5000-20000 20% 20000-40000 25% 40000-60000 30%
	 * 60000-80000 35% 80000-100000 40% 100000 -? 45%
	 * 例：若月收入15000，则应税所得为15000-2000=13000；总的个人所得税为 （13000-5000）*20% +
	 * （5000-2000）*15% + （2000-500）*10% + 500*5%= 2225
	 * 要求：读入一个整数，表示税前收入，输出应当缴纳的个人所得税和税后实际收入。
	 * 在Demo4.java编写
	 * 
	 * 5、请统计1-1000之间同时满足如下条件的数据有多少个：
	 * 
	 * 
	 * 对3整除余2 对5整除余3
	 * 
	 * 对7整除余2
	 * 在Demo5.java编写
	 * 
	 * 
	 * 6.break,continue分别有什么用?
	 * 答案:
	 * 
	 * 7、猜数字游戏: 获取1-100以内随机数：(int) （Math.random()*100）+1 获取1-10以内随机数：(int)（
	 * Math.random()*10）+1 编写程序随即生成一个1-100之间的随机数。程序提示用户输入一个数字，不停猜测，直到猜对为止
	 * 最后输出猜测的数字，和猜测的次数。并且如果没有猜中要提示用户输入的值是大了还是小了。
	 * 
	 * 要求使用do-while处理: 只能猜三次，如果超出三次，输出猜的次数过多，不能继续
	 * 在Demo6.java编写
	 * 
	 * 8、1-100之间 7的倍数的个数,并打印输出次数
	 * 在Demo7.java编写
	 * 
	 * 9（选做）、输出1～100内前5个可以被3整除的数
	 * 在Demo8.java编写
	 * 10、预习嵌套循环语句
	 * 
	 */
	public static void main(String[] args) {
		System.out.println("作业文档");
	}
}
